---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPartType
source: html/203755eb-8e5f-6133-1254-b2770b6ab605.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPartType Property

"Part Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPartType { get; }
```